       01  BOOK-RECORD.

           03  BOOK-KEY.

               05  BOOK-ISBN         PIC X(10).

           03  BOOK-TITLE            PIC X(32).

           03  BOOK-AUTHOR           PIC X(32).

           03  BOOK-CATEGORY         PIC X(10).

           03  BOOK-STOCK            PIC X(5).